doc/2019-07-29-laplaceApproximation/post-laplaceApproximation.org
#+TITLE: Introduction to Laplace approximation with examples in R
#+Author: Brice Ozenne

#+BEGIN_SRC R :exports none :results output :session *R* :cache no
options(width = 120)
path <-  "~/Documents/GitHub/bozenne.github.io/doc/2019-07-29-laplaceApproximation/"
setwd(path)
#+END_SRC

Ressource: http://www.imm.dtu.dk/~hmad/GLM/Slides_2012/week11/lect11.pdf


* Principle

Consider a positive function \(F\) of two variables \(x\) and \(y\). We would
like to marginalize \(F\) over \(x\):
#+BEGIN_EXPORT latex
\begin{align*}
F(y) &= \int_x F(x,y) dx \\
&= \int_x \exp( f(x,y) ) dx
\end{align*}
#+END_EXPORT
where \(f(x,y)=log(F(x,y))\) Assume that \(f(x,y)\) admits a global
maximum (with respect to x) at \(\hat{x}\). Then, under some
regularity assumption, we can use a taylor expansion to obtain:
#+BEGIN_EXPORT latex
\begin{align*}
F(y) &= \int_x F(x,y) dx \\
&= \int_x \exp\left( f(\hat{x},y) + \frac{(\hat{x}-x)^2}{2} f''(\hat{x},y) + o_p\left((\hat{x}-x)^2\right) \right) dx \\
&= F(\hat{x},y)  \int_x \exp\left( \frac{(\hat{x}-x)^2}{2} f''(\hat{x},y)\right)  dx + o_p\left((\hat{x}-x)^2\right) \\
&= F(\hat{x},y)  \sqrt{\frac{2\pi}{|f''(\hat{x},y)|}} + o_p\left((\hat{x}-x)^2\right) \\
\end{align*}
#+END_EXPORT

\clearpage

* Application

** Linear mixed model

*** Formula 

Consider the following linear mixed model:
#+BEGIN_EXPORT latex
\begin{align*}
Y_{ij} = X_{ij} \beta + u_i + \varepsilon_{ij} 
\end{align*}
#+END_EXPORT
where \(\varepsilon_{ij} \sim \Gaus[0,\sigma^2]\) and \(u_i \sim
\Gaus[0,\tau]\). Then denoting \(\theta = (\beta,\sigma^2,\tau)\):
#+BEGIN_EXPORT latex
\begin{align*}
F(u_i,\theta) &= \left( \prod_{j=1}^m \frac{1}{(2\pi \sigma^2)^{1/2}} \exp\left(-\frac{1}{2\sigma^2} (Y_{ij}-X_{ij}\beta-u_i)^2 \right) \right)
 \frac{1}{(2\pi \tau)^{1/2}} \exp\left(-\frac{u_i^2}{2\tau} \right) \\
f(u_i,\theta) &= - \sum_{j=1}^m \frac{1}{2} \log(2\pi \sigma^2) -\frac{1}{2\sigma^2} (Y_{ij}-X_{ij}\beta-u_i)^2 
- \frac{1}{2} \log(2\pi \tau) -\frac{u_i^2}{2\tau} \\
&=  - \frac{m}{2} \log(2\pi \sigma^2) - \frac{1}{2} \log(2\pi \tau) 
- \frac{1}{2\sigma^2} \sum_{j=1}^m (Y_{ij}-X_{ij}\beta-u_i)^2 
- \frac{1}{2\tau} u_i^2 
\end{align*}
#+END_EXPORT
So
#+BEGIN_EXPORT latex
\begin{align*}
f''(u_i,\theta) = - \frac{m}{\sigma^2} - \frac{1}{\tau} 
\end{align*}
#+END_EXPORT
and we note that a second order Taylor expansion is enough since
\(f'''(u_i,\theta)=0\). Therefore we get for the log-likelihood:
#+BEGIN_EXPORT latex
\begin{align*}
f(\theta) =
& - \frac{m}{2} \log(2\pi \sigma^2) - \frac{1}{2\sigma^2} \sum_{j=1}^m (Y_{ij}-X_{ij}\beta-\hat{u}_i)^2  \\
& - \frac{1}{2\tau} \hat{u}_i^2 - \frac{1}{2} \log(2\pi \tau) \\
& + \frac{1}{2} \log\left(\frac{2 \pi}{m\sigma^{-2} + \tau^{-1}}\right) 
\end{align*}
#+END_EXPORT

\clearpage 

