doc/2019-07-29-laplaceApproximation/post-laplaceApproximation.tex

\subsubsection{R code}
\label{sec:orgcfc9ade}

Load packages:
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
library(lava)
library(lavaSearch2)
library(mvtnorm)
library(nlme)
library(data.table)
\end{lstlisting}

Simulate data
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
mSim <- lvm(c(Y1,Y2,Y3,Y4,Y5)~tau,
	 tau ~ X1+X2)
latent(mSim) <- ~tau
transform(mSim, id ~ tau) <- function(x){1:NROW(x)}

m <- lvm(c(Y1,Y2,Y3,Y4,Y5)~1*tau,
	 tau ~ 0+X1+X2)
variance(m, ~Y1) <- "sigma"
variance(m, ~Y2) <- "sigma"
variance(m, ~Y3) <- "sigma"
variance(m, ~Y4) <- "sigma"
variance(m, ~Y5) <- "sigma"

set.seed(10)
n <- 100
dW <- as.data.table(lava::sim(mSim, n = n, latent = FALSE))
dL <- melt(dW, id.vars = c("id","X1","X2"), variable.name = "time", value.name = "Y")
\end{lstlisting}

Fit linear mixed effect model:
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
e.lava <- estimate(m, dW)
e.nlme <- lme(Y ~ -1 + X1 + X2 + time,
	      random = ~ 1|id, data = dL, method = "ML")

logLik(e.lava)
logLik(e.nlme)
\end{lstlisting}

\begin{verbatim}
'log Lik.' -810.9451 (df=9)
'log Lik.' -810.9451 (df=9)
\end{verbatim}

\clearpage

Compute marginal likelihood:
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
logLik_marginal <- function(model, data = NULL, param = NULL){
    ## initialize
    if(is.null(data)){
	data <- as.data.frame(model.frame(model))
    }
    if(is.null(param)){
	param <- coef(model)
    }

    ## find sufficient statisitcs
    Sigma <- getVarCov2(model, data = data, param = param)
    epsilon <- residuals(model, newdata = data, p = param)
    m <- NCOL(epsilon)

    ## compute log likelihood
    out <- dmvnorm(x = epsilon, mean = rep(0, m), sigma = Sigma, log = TRUE)
    ## n <- NROW(epsilon)
    ## out <- -(n*m/2)*log(2*pi) - (n/2)*log(det(Sigma)) - 0.5*sum((epsilon %*% solve(Sigma)) * epsilon)
    return(out)
}
sum(logLik_marginal(e.lava))
\end{lstlisting}

\begin{verbatim}
[1] -810.9451
\end{verbatim}

\clearpage

Compute conditional likelihood:
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
logLik_conditional <- function(model, Zb = NULL, 
			       data = NULL, param = NULL){

    ## initialize
    if(is.null(data)){
	data <- as.data.frame(model.frame(model))
    }
    if(is.null(param)){
	param <- coef(model)
    }

    ## identify variance of the random effect
    df.type <- coefType(model, as.lava=FALSE)
    df.type <- df.type[!is.na(df.type$detail),]
    tau <- param[df.type[df.type$detail=="Psi_var","param"]]

    ## estimate sufficient statistics
    Sigma.m <- getVarCov2(model, data = data, param = param)
    Sigma.c <- Sigma.m - tau
    YmXB <- residuals(model, newdata = data, p = param)

    ## compute random effects
    m <- NCOL(YmXB)
    if(is.null(Zb)){
	Z <- matrix(1, nrow = 1, ncol = m)
	Omega <- solve(Z %*% solve(Sigma.c) %*% t(Z) + 1/tau) %*% Z %*% solve(Sigma.c)
	Zb <- as.double(Omega %*% t(YmXB)) ## cbind(ranef(e.nlme),Zb)
    }
    epsilon <- YmXB - Zb

    out1 <- dmvnorm(x = epsilon, mean = rep(0, m), sigma = Sigma.c, log = TRUE)
    out2 <- dnorm(x = Zb, mean = 0, sd = sqrt(tau), log = TRUE)
    return(out1 + out2)
}
\end{lstlisting}

Laplace approximation
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
d2.f <- 5/coef(e.lava)["Y1~~Y1"]+1/coef(e.lava)["tau~~tau"]
sum(logLik_conditional(e.lava) + (1/2)*log(2*pi/d2.f))
\end{lstlisting}

\begin{verbatim}
[1] -810.9451
\end{verbatim}

\clearpage

\subsection{General gaussian model}
\label{sec:orgc6ea907}

Consider the following gaussian mixed model:
\begin{align*}
Y_{i} \sim \Gaus[\mu(X_{i}, \beta,u_i),\Sigma]
\end{align*}
Denoting by \(m\) the number of observations per individual we have:
\begin{align*}
f(u_i,\theta) &= - \frac{1}{2} \log\left((2\pi)^m |\Sigma|\right) - \frac{1}{2} (Y_{i}-\mu(X_{i},\beta,u_i)) \Sigma^{-1} \trans{(Y_{ij}-\mu(X_{i},\beta,u_i))}
- \frac{1}{2} \log(2\pi \tau) -\frac{u_i^2}{2\tau} \\
&\propto  - \frac{1}{2} \log|\Sigma| - \frac{1}{2} \log(\tau) 
- \frac{1}{2} (Y_{i}-\mu(X_{i},\beta,u_i)) \Sigma^{-1} \trans{(Y_{ij}-\mu(X_{i},\beta,u_i))}
- \frac{1}{2\tau} u_i^2 
\end{align*}
Since 
\begin{align*}
f''(u_i,\theta) = - \mu'(X_{i},\beta,u_i) \Sigma^{-1} \trans{\mu'(X_{i},\beta,u_i)} - \frac{1}{\tau}
\end{align*}
we get:
\begin{align*}
f(\theta) =
& - \frac{1}{2} \log\left((2\pi)^m |\Sigma|\right) - \frac{1}{2} (Y_{i}-\mu(X_{i},\beta,u_i)) \Sigma^{-1} \trans{(Y_{ij}-\mu(X_{i},\beta,u_i))} \\
& - \frac{1}{2} \log(2\pi \tau) -\frac{u_i^2}{2\tau} \\
& + \frac{1}{2} \log\left(\frac{2 \pi}{\mu'(X_{i},\beta,u_i) \Sigma^{-1} \trans{\mu'(X_{i},\beta,u_i)} + \tau^{-1}}\right) 
\end{align*}
\end{document}